public class day42_gs {
    public static void main(String[] args) {
        // 클래스, 객체, 인스턴스 정리

        // 1. 클래스 : 객체를 생성하는 `설계도`
        /*
         * 클래스는 붕어빵 틀이다. 붕어빵 틀은 붕어빵이 아니다.
         * 즉, 설계는 실재가 아닌 개념의 불과하다.
         */

         // 2. 객체 : 클래스에서 정의한 속성과 기능을 가진 실체
         /*
          * student1은 학생1의 속성을 가진 객체
          * student2는 학생2의 속성을 가진 객체
          * student1, student2는 같은 클래스에서 만들어졌지만 서로 다른 객체
          */

          // 3. 인스턴스 : 특정 클래스로부터 생성된 객체
          /*
           * 인스턴스는 주로 객체가 어떤 클래스에 속해 있는지 강조할 때 사용
           * 예) student1 객체는 Student 클래스의 인스턴스다.
           */

           // 4. 객체 vs 인스턴스
           /*
            * 둘 다 클래스에서 나온 실체라는 의미에서 비슷함
            * 용어상 인스턴스는 객체보다 좀 더 관계에 초점을 맞춤
            * 모든 인스턴스는 객체지만, 우리가 인스턴스라고 부르고 싶을 때는 특정 클래스로부터 그 객체가 생성되었음을 강조하고 싶을 때
            */
    }
}
